Tekla Open API Reference for Tekla Structures 2025
LinkAttributes.Scaling Property
 Gets or sets the link scaling options.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ScalingOptions Scaling { get; set; }
Public Property Scaling As ScalingOptions
	Get
	Set
Property Value
Type: ScalingOptions
See Also
Reference
LinkAttributes Class
Tekla.Structures.Drawing Namespace